[
  "NAME missed a game when his protective cup slipped and pinched a testicle.",
  "POSITION NAME started a new workout regimen at home in Crockett, Texas, back in the mid-1980s. One drill included backwards running. He promptly stepped in a gopher hole and hurt his back.",
  "POSITION NAME missed time with the Orioles in 2002 because he scorched his face in a tanning bed and was ordered by doctors to avoid direct sunlight. Standing in the sun from February through September apparently didn't give him the glow he sought.",
  "POSITION NAME dislocated his shoulder while ripping a telephone book in half emulating some motivational speakers he just heard speak.",
  "NAME might've laughed at that if he didn't miss a week after straining his back while trying to pull on his cowboy boots.",
  "According to the legend of POSITION NAME, the Red Sox rookie pitcher in 1923 thought he looked meaner without his false teeth when he was on the mound. He supposedly didn't think to put them back in his mouth while he batted. That led to him sliding into second base and getting bit in the posterior by his own teeth. He was removed from the game for excessive bleeding.",
  "POSITION NAME signed autographs for a charity one spring, stopped after 100 or so and made a beeline for the team doctor complaining of pain in his pitching elbow.",
  "In Atlanta one year, utility infielder NAME dislocated his thumb putting on his socks and spent six weeks on the disabled list.",
  "NAME, a free-spirit, blamed his absence from the TEAM lineup one year on spider bites.",
  "Tough-guy Hall of Fame pitcher NAME, famous for hog-tying Robin Ventura when Ventura rushed the mound, was bitten by a very brave coyote.",
  "NAME missed a game in the 1970s, citing fatigue. His claim: crickets got into his hotel room and kept him awake all night. That was his story. Another one of his stories: In 1974 he missed a game because his eyelid was \"stuck open,\" preventing him from blinking (but not, apparently, fabricating bogus injuries).",
  "NAME missed several games one August. The reason: frostbite. Why do I feel the need to add \"allegedly\"?",
  "TEAM closer NAME missed the entire 1970 season when his ring got caught on an awning as he tried to demonstrate his slam dunk technique.",
  "Reliever NAME once missed two starts after spending an entire game flicking sunflower seeds at a friend who was sitting nearby. Diagnosis: inflamed elbow.",
  "POSITION NAME broke a rib vomiting.",
  "NAME only strained a muscle while vomiting.",
  "NAME broke a toe while running from the kitchen to the TV. Why the rush? To see Bill Buckner hit. I would've guessed it was to see Bill Buckner field.",
  "POSITION NAME, who came from a proud baseball family, injured his knee falling off a treadmill, then hurt his knee again a year later running over his son with a bike.",
  "POSITION NAME got bit by his mother-in-law's dog. Perhaps on command.",
  "Watching a brawl break out one game, reliever NAME leapt to his feet in defense of his teammates and strained a calf muscle.",
  "Cubs' pitcher NAME went on the DL with a fractured right big toe suffered while tying to jump the dugout railing to celebrate a TEAM victory.",
  "NAME didn't get hurt vomiting all the time. Once, according to ESPN.com, he showed up at spring training four days late after getting hurt eating a microwaved donut and requiring a root canal.",
  "TEAM outfielder NAME fell out of bed and crashed into a glass table while having a nightmare that he was covered by spiders. To which even the most sympathetic manager would say, \"Yeah, sure you did.\"",
  "In 2011, NAME strained his hamstring while stretching to avoid, you know, straining his hamstring."
]